# ToposolidElevationAtTop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ToposolidElevationAtTop Property
ParameterTypeId Class See Also
---
"Elevation at Top"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ToposolidElevationAtTop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ToposolidElevationAtTop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ToposolidElevationAtTop {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace